---
kind: type
id: T:Autodesk.Revit.DB.HasNoValueFilterRule
source: html/ad2f6893-5c2a-3921-882e-b50276748340.htm
---
# Autodesk.Revit.DB.HasNoValueFilterRule

Tests whether an element's parameter doesn't have a value.

## Syntax (C#)
```csharp
public class HasNoValueFilterRule : ParameterValuePresenceRule
```